Revit 2026 API

# PartMakerMethodToDivideVolumes Class

---

By-References dividing strategy used by PartMaker element. TODO_REFACTOR("LegacyMechanismOfMovingElements") returns true if \- the Host Elements are not floors or walls \- OR \- the Host Elements that are referenced by this PartMaker are floors or walls \- transformation has already been applied on those Host Elements

SystemObject Autodesk.Revit.DBPartMakerMethodToDivideVolumes

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PartMakerMethodToDivideVolumes : IDisposable
```
```vb
Public Class PartMakerMethodToDivideVolumes
	Implements IDisposable
```
```cpp
public ref class PartMakerMethodToDivideVolumes : IDisposable
```
```fsharp
type PartMakerMethodToDivideVolumes =
    class
        interface IDisposable
    end
```

The PartMakerMethodToDivideVolumes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DivisionGap | The gap which is created between matching profiles of parts. |
|  | DivisionPatternMirror | Whether pattern defined by the division rule should be mirrored before application Mirroring is similar to changing indices of u-const gridlines. |
|  | DivisionRotationAngle | Angle by which both u- and v- gridlines of the division are rotated with respect to the natural u/v-const directions of the sketch plane. |
|  | DivisionRuleId | Id of the 'DivisionRule' which is used to augment the cutting sketch. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ProfileFlipAcross | True if the corresponding left/upper parts profile are mirrored with respect to the division line. False if the profile of left/upper parts are defined directly by the profile family. |
|  | ProfileFlipAlong | True if the corresponding left/upper parts profile are mirrored with respect to the center line of the hosts to be divided. False if the profile of left/upper parts are defined directly by the profile family. |
|  | ProfileMatch | Determines how two profiles match. |
|  | ProfileOffset | The offset which is applied to a family-defined profile in the direction away from the division line and toward left/upper part to obtain its profile. |
|  | ProfileType | The id of the profile family applied to boundaries between parts. |
|  | UConstDivisionIndent | Indentation for the application of division rule's pattern across u-const gridlines (i.e., similar to changing indices of u-const gridlines). |
|  | VConstDivisionIndent | Indentation for the application of division rule's pattern across v-const gridlines (i.e., similar to changing indices of v-const gridlines). |

|  | Name | Description |
| --- | --- | --- |
|  | AddIntersectingReference | Adds intersecting reference with an offset. |
|  | AreElementsValidIntersectingReferences(ICollectionElementId) |  |
|  | AreElementsValidIntersectingReferences(Document, ICollectionElementId) |  |
|  | CanBeDivisionProfile(ElementId) | Checks whether a family defines a profile which can be used by this method. |
|  | CanBeDivisionProfile(ElementId, Document) | Checks whether a family defines a profile which can be used by this method. |
|  | Dispose | Releases all resources used by the PartMakerMethodToDivideVolumes |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOffsetForIntersectingReference | Gets offset for the intersecting reference. |
|  | GetPlaneOfSketch | Gets the plane of the sketch. |
|  | GetSketchCurves |  |
|  | GetSplitRefsOffsets | Returns offsets for plane-defining splitters. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsElementValidIntersectingReference(ElementId) | Identifies if the provided member is valid. |
|  | IsElementValidIntersectingReference(Document, ElementId) | Identifies if the provided member is valid. |
|  | IsValidSketchPlane | Identifies if provided sketch plane is valid. |
|  | RemoveIntersectingReference | Removed intersecting reference. |
|  | SetOffsetForIntersectingReference | Sets offset for the intersecting reference. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | UsesReference | Identifies if the PartMaker uses the intersecting reference. |

#### Reference

Autodesk.Revit.DB Namespace